app/controllers/meetings_controller.rb

  def index
    @meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"

  def show
    @meeting = Meeting.find(params[:id])
---
SELECT "meetings".* FROM "meetings" WHERE ("meetings"."id" = 1) LIMIT 1

  def create
    @meeting = Meeting.new(params[:meeting])

    respond_to do |format|
      if @meeting.save
---
INSERT INTO "meetings" ("updated_at", "description", "created_at", "title") VALUES ('2010-12-16 09:45:25.316486', 'Description.