app/controllers/sessions_controller.rb

  def linkedin_callback
    if params[:oauth_verifier]
 			pin = params[:oauth_verifier]
	    atoken, asecret = @@client.authorize_from_request(session[:rtoken], session[:rsecret], pin)
	    begin
				profile = @@client.profile(:fields => %w(id))
	    	linkedin_id = profile.id
			rescue Exception
			  flash[:error] = 'LinkedIn authenticatie is mislukt, probeer het opnieuw.'
				redirect_to login_url
	    end

	    if user = User.find_by_linkedin_id(linkedin_id)
---
SELECT "users".* FROM "users" WHERE ("users"."linkedin_id" = 'HmHKxBZcF3') LIMIT 1