app/controllers/users_controller.rb

  def linkedin_callback
    user = User.find_by_ticket(params[:ticket])
    unless user.linkedin_id
	    client = LinkedIn::Client.new("TMERi4FIyPAGjBhjwBtpd6wT-dBuVYU3fBbbtTuzXGlYgTlDHfT9KK5cZqYRAC5m", "sD8x8zFOk7atIx1n7Ei5NmAFOkvLkLlnlqDZ8gvPURnaEB1hrcoOxaJgh0tZp6wf")
	    if params[:oauth_verifier]
	 			pin = params[:oauth_verifier]
		    atoken, asecret = client.authorize_from_request(session[:rtoken], session[:rsecret], pin)
		    begin
					profile = client.profile(:fields => %w(id))
					user.linkedin_id = profile.id
			    user.linkedin_token = atoken
			    user.linkedin_secret = asecret
				rescue Exception
					@authenticated = false
					flash[:error] = 'Linkedin authentication failed, please authenticate again.'
					redirect_to 'users/confirmation/#{user.ticket}'
		    end
		    if user.save
---
SELECT "users"."id" FROM "users" WHERE ("users"."ticket" = 'e46f34253f56c2e0fd2f483887d436e7') AND ("users".id <> 2) LIMIT 1
UPDATE "users" SET "linkedin_token" = '1f00aede-231c-4443-af38-bb53e1d5b43a', "linkedin_secret" = '4d695a7a-7fb8-4b2b-9449-21203d3f43b7', "linkedin_id" = 'HmHKxBZcF3', "updated_at" = '2010-12-16 10:17:54.637869' WHERE ("users"."id" = 2)

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def confirmation
  	unless session[:linkedin_id]
	  	user = User.find_by_ticket(params[:ticket])
	    if user.linkedin_id
	    	redirect_to login_url, :notice => 'You have already linked your account with LinkedIn. Please login as usual.'
	    else
	    	params[:id] = user.id
				linkedin_authenticate params[:ticket]
	    end
    else
    	redirect_to User.find_by_linkedin_id(session[:linkedin_id]), :notice => 'You are already logged in.'
---
SELECT "users".* FROM "users" WHERE ("users"."ticket" = 'ac6a0a2cb9808e4ad7000c7bc2a2ad39') LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."linkedin_id" = 'HmHKxBZcF3') LIMIT 1

  def create
    @user = User.new(params[:user])
    @user.ticket = User.generate_ticket

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("linkedin_secret", "linkedin_token", "ticket", "last_name", "first_name", "created_at", "email", "linkedin_id", "updated_at") VALUES (NULL, NULL, 'e46f34253f56c2e0fd2f483887d436e7', 'Jetten', 'Bram', '2010-12-16 10:08:15.383010', 'mail@bramjetten.nl', NULL, '2010-12-16 10:08:15.383010')

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE ("users"."id" = 1)